# figura = ["треугольник","четырехугольник","пятиугольник","шестиугольник","семиугольник","восьмиугольник","девятиугольник","десятиугольник"]
a = int(input("Введите число углов"))
if a == 3:
    print("Треугольник")
elif a == 4:
    print("Четырехугольник")
elif a == 5:
    print("Пятиугольник")
elif a == 6:
    print("Шестиугольник")
elif a == 7:
    print("Семиугольник")
elif a == 8:
    print("Восьмиугольник")
elif a == 9:
    print("Девятиугольник")
elif a == 10:
    print("Дясятиугольник")
else:
    print("Это число не входит в деопозон")
